FV2404/E_1008.dot
digraph D {
    labelloc="t";
    label=<<B><FONT POINT-SIZE="18">Sperrprozesse Gas</FONT></B><BR align="left"/><BR/><B><FONT POINT-SIZE="16">19.1.2: AD: Abrechnung einer sonstigen Leistung</FONT></B><BR align="left"/><BR/><BR/><BR/>>;
    ratio="compress";
    concentrate=true;
    pack=true;
    rankdir=TB;
    packmode="array";
    size="20,20";
    fontsize=12;
    "Start" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#8ba2d7", label=<<B>E_1008</B><BR align="left"/><FONT>Prüfende Rolle: <B>NB</B></FONT><BR align="center"/>>, fontname="Roboto, sans-serif"];
    "10" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#c2cee9", label=<<B>10: </B>Bezieht sich das Nicht-Zahlungsavis auf eine Rechnung der Kategorie<BR align="left"/>„Unterbrechung der Anschlussnutzung (Sperren)“?<BR align="left"/>>, fontname="Roboto, sans-serif"];
    "20" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#c2cee9", label=<<B>20: </B>Bezieht sich das Nicht-Zahlungsavis auf eine Rechnung der Kategorie<BR align="left"/>„Verzugskosten“?<BR align="left"/>>, fontname="Roboto, sans-serif"];
    "A16" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#c4cac1", label=<<B>A16</B><BR align="left"/><BR align="left"/><FONT>Abrechnung „Blindarbeit“ für Sparte Gas nicht relevant.<BR align="left"/></FONT>>, fontname="Roboto, sans-serif"];
    "30" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#c2cee9", label=<<B>30: </B>Hat der Lieferant wegen fehlendem Preisblatt „Preisblatt Sperren / Entsperren<BR align="left"/>und Verzugskosten“ abgelehnt?<BR align="left"/>>, fontname="Roboto, sans-serif"];
    "40" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#c2cee9", label=<<B>40: </B>Wurde dem Lieferanten ein für die Rechnung gültiges Preisblatt versendet?<BR align="left"/>>, fontname="Roboto, sans-serif"];
    "A01" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#c4cac1", label=<<B>A01</B><BR align="left"/><BR align="left"/><FONT>Ein gültiges Preisblatt wurde versendet.<BR align="left"/>Hinweis: Angabe von Datenaustauschreferenz incl. Nr. der Empfangsbestätigung<BR align="left"/>des an ihm versandten, für die Rechnung gültigen Preisblatts.<BR align="left"/></FONT>>, fontname="Roboto, sans-serif"];
    "Versand der Nachricht „Storno der ursprünglichen Rechnung“" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#c4cac1", label=<<FONT>Versand der Nachricht „Storno der ursprünglichen Rechnung“<BR align="left"/></FONT>>, fontname="Roboto, sans-serif"];
    "50" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#c2cee9", label=<<B>50: </B>Hat der Lieferant wegen unbekanntem Sperrauftrag abgelehnt?<BR align="left"/>>, fontname="Roboto, sans-serif"];
    "60" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#c2cee9", label=<<B>60: </B>Liegt ein bestätigter Sperrauftrag mit der angegebenen Referenz auf den<BR align="left"/>Sperrauftrag des Lieferanten vor?<BR align="left"/>>, fontname="Roboto, sans-serif"];
    "A02" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#c4cac1", label=<<B>A02</B><BR align="left"/><BR align="left"/><FONT>Gültiger Sperrauftrag ist vorhanden<BR align="left"/>Hinweis: Angabe von Datenaustauschreferenz incl. Nr. der Empfangsbestätigung<BR align="left"/>des Sperrauftrags.<BR align="left"/></FONT>>, fontname="Roboto, sans-serif"];
    "70" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#c2cee9", label=<<B>70: </B>Hat der Lieferant die Rechnung wegen Angabe einer falschen Artikel-ID abgelehnt?<BR align="left"/>>, fontname="Roboto, sans-serif"];
    "80" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#c2cee9", label=<<B>80: </B>Hat der LF den Sperrauftrag storniert und wurde diese Stornierung vom NB bestätigt?<BR align="left"/>>, fontname="Roboto, sans-serif"];
    "90" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#c2cee9", label=<<B>90: </B>Wurde die korrekte Artikel-ID entsprechend eines stornierten Sperrauftrags in<BR align="left"/>der Rechnung angegeben?<BR align="left"/>>, fontname="Roboto, sans-serif"];
    "A15" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#c4cac1", label=<<B>A15</B><BR align="left"/><BR align="left"/><FONT>Korrekte Artikel-ID für die Abrechnung eines stornierten Sperrauftrags wurde in der Rechnung angegeben<BR align="left"/>Hinweis: Angabe von Datenaustauschreferenz incl. Nr. der Empfangsbestätigung<BR align="left"/>aus der Stornierung.<BR align="left"/></FONT>>, fontname="Roboto, sans-serif"];
    "100" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#c2cee9", label=<<B>100: </B>Wurde die korrekte Artikel-ID entsprechend des Ergebnisses des Sperrauftrags in<BR align="left"/>der Rechnung angegeben?<BR align="left"/>>, fontname="Roboto, sans-serif"];
    "A03" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#c4cac1", label=<<B>A03</B><BR align="left"/><BR align="left"/><FONT>Korrekte Artikel-ID wurde in der Rechnung angegeben<BR align="left"/>Hinweis: Angabe von Datenaustauschreferenz incl. Nr. der Empfangsbestätigung<BR align="left"/>aus dem Ergebnis des Sperrauftrags.<BR align="left"/></FONT>>, fontname="Roboto, sans-serif"];
    "110" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#c2cee9", label=<<B>110: </B>Hat der Lieferant die Rechnung abgelehnt, da auf der Rechnung ein, zum<BR align="left"/>Preisblatt abweichender Preis angegeben wurde?<BR align="left"/>>, fontname="Roboto, sans-serif"];
    "120" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#c2cee9", label=<<B>120: </B>Wurde in der Rechnung der im Preisblatt angegebene Preis abgerechnet?<BR align="left"/>>, fontname="Roboto, sans-serif"];
    "A04" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#c4cac1", label=<<B>A04</B><BR align="left"/><BR align="left"/><FONT>Korrekter Preis zum gültigen Preisblatt wurde in der Rechnung angegeben<BR align="left"/>Hinweis: Angabe von Datenaustauschreferenz incl. Nr. der Empfangsbestätigung<BR align="left"/>des Preisblatts<BR align="left"/></FONT>>, fontname="Roboto, sans-serif"];
    "130" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#c2cee9", label=<<B>130: </B>Ergibt die Prüfung der abgelehnten Rechnung, dass die Ablehnung durch den<BR align="left"/>Lieferanten gerechtfertigt war?<BR align="left"/>>, fontname="Roboto, sans-serif"];
    "A05" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#c4cac1", label=<<B>A05</B><BR align="left"/><BR align="left"/><FONT>Die Rechnung wird als korrekt angesehen<BR align="left"/>Hinweis: Es ist zu begründen, warum die Rechnung korrekt war.<BR align="left"/></FONT>>, fontname="Roboto, sans-serif"];
    "140" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#c2cee9", label=<<B>140: </B>Hat der Lieferant wegen fehlendem Preisblatt „Preisblatt Sperren / Entsperren<BR align="left"/>und Verzugskosten“ abgelehnt?<BR align="left"/>>, fontname="Roboto, sans-serif"];
    "150" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#c2cee9", label=<<B>150: </B>Wurde dem Lieferanten ein für die Rechnung gültiges Preisblatt fristgerecht versendet?<BR align="left"/>>, fontname="Roboto, sans-serif"];
    "A06" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#c4cac1", label=<<B>A06</B><BR align="left"/><BR align="left"/><FONT>Gültiges Preisblatt wurde versendet.<BR align="left"/>Hinweis: Angabe von Datenaustauschreferenz incl. Nr. der Empfangsbestätigung<BR align="left"/></FONT>>, fontname="Roboto, sans-serif"];
    "160" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#c2cee9", label=<<B>160: </B>Hat der Lieferant wegen unbekannter Rechnung, auf die sich die<BR align="left"/>Verzugskostenrechnung bezieht, abgelehnt?<BR align="left"/>>, fontname="Roboto, sans-serif"];
    "170" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#c2cee9", label=<<B>170: </B>Wurde die Rechnung, auf die sich die Verzugskostenrechnung bezieht, dem<BR align="left"/>Lieferanten zugestellt?<BR align="left"/>>, fontname="Roboto, sans-serif"];
    "180" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#c2cee9", label=<<B>180: </B>Wurde die Rechnung, auf die sich die Verzugskostenrechnung bezieht, storniert?<BR align="left"/>>, fontname="Roboto, sans-serif"];
    "A07" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#c4cac1", label=<<B>A07</B><BR align="left"/><BR align="left"/><FONT>Gültige Rechnung ist vorhanden<BR align="left"/>Hinweis: Angabe von Datenaustauschreferenz incl. Nr. der Empfangsbestätigung<BR align="left"/>der Rechnung, auf die sich die Verzugskostenrechnung bezieht.<BR align="left"/></FONT>>, fontname="Roboto, sans-serif"];
    "190" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#c2cee9", label=<<B>190: </B>Hat der Lieferant die Rechnung wegen Angabe einer falschen Artikel-ID abgelehnt?<BR align="left"/>>, fontname="Roboto, sans-serif"];
    "200" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#c2cee9", label=<<B>200: </B>Wurde genau eine der beiden Artikel-ID für Verzugskosten in der Rechnung angegeben?<BR align="left"/>>, fontname="Roboto, sans-serif"];
    "A08" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#c4cac1", label=<<B>A08</B><BR align="left"/><BR align="left"/><FONT>Es wurde für die Verzugskosten eine der beiden Artikel-ID verwendet<BR align="left"/></FONT>>, fontname="Roboto, sans-serif"];
    "210" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#c2cee9", label=<<B>210: </B>Hat der Lieferant die Rechnung abgelehnt, da auf der Rechnung ein zum<BR align="left"/>Preisblatt abweichender Preis angeben wurde?<BR align="left"/>>, fontname="Roboto, sans-serif"];
    "220" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#c2cee9", label=<<B>220: </B>Wurde in der Rechnung die Artikel-ID 2-02-0-001 (Verzugskosten pauschal) angegeben?<BR align="left"/>>, fontname="Roboto, sans-serif"];
    "230" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#c2cee9", label=<<B>230: </B>Ist der angegeben Preis in der Rechnung identisch mit dem Preis für die<BR align="left"/>Artikel-ID 2-02-0-001 (Verzugskosten pauschal) aus dem Preisblatt?<BR align="left"/>>, fontname="Roboto, sans-serif"];
    "A09" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#c4cac1", label=<<B>A09</B><BR align="left"/><BR align="left"/><FONT>Korrekter Preis wurde in der Rechnung abgerechnet<BR align="left"/>Hinweis: Angabe von Datenaustauschreferenz incl. Nr. der Empfangsbestätigung<BR align="left"/>des Preisblatts<BR align="left"/></FONT>>, fontname="Roboto, sans-serif"];
    "240" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#c2cee9", label=<<B>240: </B>Ist der Preis, der in der Rechnung für die Artikel-ID 2-02-0-002 (Verzugskosten<BR align="left"/>variabel) in Rechnung gestellt wurde für die der Verzugsrechnung<BR align="left"/>zugrundeliegende, nicht bezahlte Rechnung angemessen?<BR align="left"/>>, fontname="Roboto, sans-serif"];
    "A10" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#c4cac1", label=<<B>A10</B><BR align="left"/><BR align="left"/><FONT>Die Rechnung wird als korrekt angesehen<BR align="left"/>Hinweis: Es ist zu begründen, warum die Rechnung korrekt war.<BR align="left"/></FONT>>, fontname="Roboto, sans-serif"];
    "250" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#c2cee9", label=<<B>250: </B>Ergibt die Prüfung der abgelehnten Rechnung, dass die Ablehnung durch den<BR align="left"/>Lieferanten gerechtfertigt war?<BR align="left"/>>, fontname="Roboto, sans-serif"];
    "A11" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#c4cac1", label=<<B>A11</B><BR align="left"/><BR align="left"/><FONT>Die Rechnung wird als korrekt angesehen<BR align="left"/>Hinweis: Es ist zu begründen, warum die Rechnung korrekt war.<BR align="left"/></FONT>>, fontname="Roboto, sans-serif"];

    "Start" -> "10" [color="#88a0d6"];
    "10" -> "30" [label=<<B>JA</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "10" -> "20" [label=<<B>NEIN</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "20" -> "140" [label=<<B>JA</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "20" -> "A16" [label=<<B>NEIN</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "30" -> "40" [label=<<B>JA</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "30" -> "50" [label=<<B>NEIN</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "40" -> "A01" [label=<<B>JA</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "40" -> "Versand der Nachricht „Storno der ursprünglichen Rechnung“" [label=<<B>NEIN</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "50" -> "60" [label=<<B>JA</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "50" -> "70" [label=<<B>NEIN</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "60" -> "A02" [label=<<B>JA</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "60" -> "Versand der Nachricht „Storno der ursprünglichen Rechnung“" [label=<<B>NEIN</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "70" -> "80" [label=<<B>JA</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "70" -> "110" [label=<<B>NEIN</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "80" -> "90" [label=<<B>JA</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "80" -> "100" [label=<<B>NEIN</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "90" -> "A15" [label=<<B>JA</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "90" -> "Versand der Nachricht „Storno der ursprünglichen Rechnung“" [label=<<B>NEIN</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "100" -> "A03" [label=<<B>JA</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "100" -> "Versand der Nachricht „Storno der ursprünglichen Rechnung“" [label=<<B>NEIN</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "110" -> "120" [label=<<B>JA</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "110" -> "130" [label=<<B>NEIN</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "120" -> "A04" [label=<<B>JA</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "120" -> "Versand der Nachricht „Storno der ursprünglichen Rechnung“" [label=<<B>NEIN</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "130" -> "A05" [label=<<B>NEIN</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "130" -> "Versand der Nachricht „Storno der ursprünglichen Rechnung“" [label=<<B>JA</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "140" -> "150" [label=<<B>JA</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "140" -> "160" [label=<<B>NEIN</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "150" -> "A06" [label=<<B>JA</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "150" -> "Versand der Nachricht „Storno der ursprünglichen Rechnung“" [label=<<B>NEIN</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "160" -> "170" [label=<<B>JA</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "160" -> "190" [label=<<B>NEIN</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "170" -> "180" [label=<<B>JA</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "170" -> "Versand der Nachricht „Storno der ursprünglichen Rechnung“" [label=<<B>NEIN</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "180" -> "A07" [label=<<B>NEIN</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "180" -> "Versand der Nachricht „Storno der ursprünglichen Rechnung“" [label=<<B>JA</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "190" -> "200" [label=<<B>JA</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "190" -> "210" [label=<<B>NEIN</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "200" -> "A08" [label=<<B>JA</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "200" -> "Versand der Nachricht „Storno der ursprünglichen Rechnung“" [label=<<B>NEIN</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "210" -> "220" [label=<<B>JA</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "210" -> "250" [label=<<B>NEIN</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "220" -> "230" [label=<<B>JA</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "220" -> "240" [label=<<B>NEIN</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "230" -> "A09" [label=<<B>JA</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "230" -> "Versand der Nachricht „Storno der ursprünglichen Rechnung“" [label=<<B>NEIN</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "240" -> "A10" [label=<<B>JA</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "240" -> "Versand der Nachricht „Storno der ursprünglichen Rechnung“" [label=<<B>NEIN</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "250" -> "A11" [label=<<B>NEIN</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "250" -> "Versand der Nachricht „Storno der ursprünglichen Rechnung“" [label=<<B>JA</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];

    bgcolor="transparent";
fontname="Roboto, sans-serif";
}
